In [28]:
import numpy as np
import pandas as pd

df1 = pd.DataFrame({'Apples':[30],'Bananas':[21]})
df1

   Apples  Bananas
0      30       21

In [29]:
df2 = pd.DataFrame([[35,21],[41,34]],index=['2017 Sales','2018 Sales'],columns=['Apples','Bananas'])
df2

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

In [18]:
df3 = pd.DataFrame({'city':['Austin','Dallas','Austin','Dallas'],
                    'visitor':[139,237,326,456],
                    'weekday':['Sun','Sun','Mon','Mon']})
df3

     city  visitor weekday
0  Austin      139     Sun
1  Dallas      237     Sun
2  Austin      326     Mon
3  Dallas      456     Mon

In [20]:
print(df3.describe())

          visitor
count    4.000000
mean   289.500000
std    134.735543
min    139.000000
25%    212.500000
50%    281.500000
75%    358.500000
max    456.000000

In [40]:
visitor = (df3['visitor'])
visitor_sun = visitor[0:1]
visitor_mon = visitor[2:3]
avg_Sun = np.mean(visitor_sun)
avg_Mon = np.mean(visitor_mon)
print(visitor)
print('avg_Sun',avg_Sun,'avg_Mon',avg_Mon)

0    139
1    237
2    326
3    456
Name: visitor, dtype: int64
avg_Sun 139.0 avg_Mon 326.0

In [32]:
for day in set(df3['weekday']):
    print(day,df3[df3['weekday']==day]['visitor'].mean())

Mon 391.0
Sun 188.0